## Ordinal Number Encoding

In [24]:
import datetime

In [2]:
today_date = datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 12, 31, 6, 58, 30, 118663)

In [5]:
days = [today_date - datetime.timedelta(x) for x in range(15)]

In [39]:
import pandas as pd
df = pd.DataFrame(days)
df.columns =["day"]

In [41]:
df['weekday'] = df['day'].dt.day_name()

In [42]:
weekday_dictonary = {"Monday" :1, "Tuesday":2, "Wednesday":3, "Thursday":4, "Friday":5, "Saturday":6, "Sunday":7}

In [43]:
df['weekday_ordinal'] = df['weekday'].map(weekday_dictonary)

In [44]:
df.head()

                         day    weekday  weekday_ordinal
0 2021-12-31 06:58:30.118663     Friday                5
1 2021-12-30 06:58:30.118663   Thursday                4
2 2021-12-29 06:58:30.118663  Wednesday                3
3 2021-12-28 06:58:30.118663    Tuesday                2
4 2021-12-27 06:58:30.118663     Monday                1

## Frequency Count

In [65]:
import pandas as pd

df = pd.read_csv('TatanicDataSet.csv')

In [71]:
Cabin_map = df['Cabin'].value_counts().to_dict()

In [67]:
df['Cabin_map'] = df['Cabin'].map(Cabin_map)

In [68]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin_map
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,2.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN

## Target Guided Ordinal Encoding

In [72]:
import pandas as pd

df = pd.read_csv('TatanicDataSet.csv',usecols=['Cabin','Survived'])

In [75]:
df['Cabin'] =df['Cabin'].fillna('Not exits')

In [77]:
df['Cabin_cat'] = df['Cabin'].astype(str).str[0]

In [78]:
df.Cabin_cat.unique()

array(['N', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [80]:
df.groupby('Cabin_cat')['Survived'].mean()

Cabin_cat
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
N    0.299854
T    0.000000
Name: Survived, dtype: float64

In [83]:
df.groupby('Cabin_cat')['Survived'].mean().sort_values().index

Index(['T', 'N', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin_cat')

In [84]:
ordinal_lables = df.groupby('Cabin_cat')['Survived'].mean().sort_values().index
ordinal_lables

Index(['T', 'N', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin_cat')

In [87]:
ordinal_lables1 = {k:i for i,k in enumerate(ordinal_lables,0)}

In [88]:
ordinal_lables1

{'T': 0, 'N': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [90]:
df['Cabin_cat'] = df['Cabin_cat'].map(ordinal_lables1)

In [91]:
df.head()

   Survived      Cabin  Cabin_cat
0         0  Not exits          1
1         1        C85          4
2         1  Not exits          1
3         1       C123          4
4         0  Not exits          1

## Mean Encoding

In [93]:
mean_ordinal = df.groupby('Cabin_cat')['Survived'].mean().to_dict()

In [96]:
df['Cabin_cat_mean_ordinal'] = df['Cabin_cat'].map(mean_ordinal)

In [97]:
df.head()

   Survived      Cabin  Cabin_cat  Cabin_Cat  Cabin_cat_mean_ordinal
0         0  Not exits   0.299854   0.000000                     NaN
1         1        C85   0.593220   0.299854                     NaN
2         1  Not exits   0.299854   0.466667                     NaN
3         1       C123   0.593220   0.500000                     NaN
4         0  Not exits   0.299854   0.593220                     NaN